app/controllers/dashboard_controller.rb

SELECT "catigories".* FROM "catigories"
SELECT "softwares".* FROM "softwares"
---
  def index
    @catigories = Catigory.all
    @softwares = Software.all