app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("name", "description", "due_date", "completion", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @task = @project.tasks.build(task_params)

    if @task.save

UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "test"], ["updated_at", "2023-12-09 20:59:37.310666"], ["id", 31]]
---
  def update
    if @task.update(task_params)

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ? AND "projects"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def set_project
    @project = current_user.projects.find(params[:project_id])